pycom/pycom-micropython-sigfox/esp32/pygate/concentrator/loragw_reg_esp.c
/* -------------------------------------------------------------------------- */
/* --- PRIVATE VARIABLES ---------------------------------------------------- */

static int lgw_regpage = -1; /*! keep the value of the register page selected */

/* -------------------------------------------------------------------------- */
/* --- PRIVATE FUNCTIONS ---------------------------------------------------- */

static int page_switch(uint8_t target) {
    lgw_regpage = PAGE_MASK & target;
    sx1308_spiWrite(PAGE_ADDR, (uint8_t)lgw_regpage);
    return LGW_REG_SUCCESS;
}

/* ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ */

/* soft-reset function */
int esp_lgw_soft_reset(void) {
    sx1308_spiWrite(0, 0x80); /* 1 -> SOFT_RESET bit */
    lgw_regpage = 0; /* reset the paging static variable */
    return LGW_REG_SUCCESS;
}

/* ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ */

int esp_reg_w_align32(void *spi_target, uint8_t spi_mux_mode, uint8_t spi_mux_target, const struct lgw_reg_s *r, int32_t reg_value) {
    int i, size_byte;
    uint8_t buf[4] = {0, 0, 0, 0};

    if ((r->leng == 8) && (r->offs == 0)) {
        /* direct write */
        sx1308_spiWrite(r->addr, (uint8_t)reg_value);
    } else if ((r->offs + r->leng) <= 8) {
        /* single-byte read-modify-write, offs:[0-7], leng:[1-7] */
        buf[0] = sx1308_spiRead(r->addr);
        buf[1] = ((1 << r->leng) - 1) << r->offs; /* bit mask */
        buf[2] = ((uint8_t)reg_value) << r->offs; /* new data offsetted */
        buf[3] = (~buf[1] & buf[0]) | (buf[1] & buf[2]); /* mixing old & new data */
        sx1308_spiWrite(r->addr, (uint8_t)buf[3]);
    } else if ((r->offs == 0) && (r->leng > 0) && (r->leng <= 32)) {
        /* multi-byte direct write routine */
        size_byte = (r->leng + 7) / 8; /* add a byte if it's not an exact multiple of 8 */
        for (i = 0; i < size_byte; ++i) {
            /* big endian register file for a file on N bytes
            Least significant byte is stored in buf[0], most one in buf[N-1] */
            buf[i] = (uint8_t)(0x000000FF & reg_value);
            reg_value = (reg_value >> 8);
        }
        sx1308_spiWriteBurst( r->addr, buf, size_byte);
    } else {
        /* register spanning multiple memory bytes but with an offset */

        return LGW_REG_ERROR;
    }

    return LGW_REG_SUCCESS;
}

/* ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ */

int esp_reg_r_align32(void *spi_target, uint8_t spi_mux_mode, uint8_t spi_mux_target, const struct lgw_reg_s *r, int32_t *reg_value) {
    uint8_t bufu[4] = {0, 0, 0, 0};
    int8_t *bufs = (int8_t *)bufu;
    int i, size_byte;
    uint32_t u = 0;

    if ((r->offs + r->leng) <= 8) {
        /* read one byte, then shift and mask bits to get reg value with sign extension if needed */
        bufu[0] = sx1308_spiRead(r->addr);
        bufu[1] = bufu[0] << (8 - r->leng - r->offs); /* left-align the data */
        if (r->sign == true) {
            bufs[2] = bufs[1] >> (8 - r->leng); /* right align the data with sign extension (ARITHMETIC right shift) */
            *reg_value = (int32_t)bufs[2]; /* signed pointer -> 32b sign extension */
        } else {
            bufu[2] = bufu[1] >> (8 - r->leng); /* right align the data, no sign extension */
            *reg_value = (int32_t)bufu[2]; /* unsigned pointer -> no sign extension */
        }
    } else if ((r->offs == 0) && (r->leng > 0) && (r->leng <= 32)) {
        size_byte = (r->leng + 7) / 8; /* add a byte if it's not an exact multiple of 8 */
        sx1308_spiReadBurst(r->addr, bufu, size_byte);
        u = 0;
        for (i = (size_byte - 1); i >= 0; --i) {
            u = (uint32_t)bufu[i] + (u << 8); /* transform a 4-byte array into a 32 bit word */
        }
        if (r->sign == true) {
            u = u << (32 - r->leng); /* left-align the data */
            *reg_value = (int32_t)u >> (32 - r->leng); /* right-align the data with sign extension (ARITHMETIC right shift) */
        } else {
            *reg_value = (int32_t)u; /* unsigned value -> return 'as is' */
        }
    } else {
        /* register spanning multiple memory bytes but with an offset */
        return LGW_REG_ERROR;
    }

    return LGW_REG_SUCCESS;
}

/* -------------------------------------------------------------------------- */
/* --- PUBLIC FUNCTIONS DEFINITION ------------------------------------------ */

int esp_lgw_connect(void) {
    sx1308_init();
    sx1308_spiWrite(LGW_PAGE_REG, 0);

    return LGW_REG_SUCCESS;
}

/* ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ */

int esp_lgw_reg_w(uint16_t register_id, int32_t reg_value) {
    const struct lgw_reg_s *r;

    /* check input parameters */
    if (register_id >= LGW_TOTALREGS) {
        return LGW_REG_ERROR;
    }

    /* intercept direct access to PAGE_REG & SOFT_RESET */
    if (register_id == LGW_PAGE_REG) {
        page_switch(reg_value);
        return LGW_REG_SUCCESS;
    } else if (register_id == LGW_SOFT_RESET) {
        /* only reset if lsb is 1 */
        if ((reg_value & 0x01) != 0) {
            return LGW_REG_SUCCESS;
        }
    }

    /* get register struct from the struct array */
    r = &loregs[register_id];

    /* reject write to read-only registers */
    if (r->rdon == 1) {

        return LGW_REG_ERROR;
    }

    /* select proper register page if needed */
    if ((r->page != -1)) {
        page_switch(r->page);
    }

    esp_reg_w_align32(0, 0, 0, r, reg_value);

    return LGW_REG_SUCCESS;
}

/* ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ */

int esp_lgw_reg_r(uint16_t register_id, int32_t *reg_value) {
    const struct lgw_reg_s *r;

    /* get register struct from the struct array */
    r = &loregs[register_id];

    /* select proper register page if needed */
    if ((r->page != -1)) { // && (r->page != lgw_regpage)) {
        page_switch(r->page);
    }

    esp_reg_r_align32(0, 0, 0, r, reg_value);

    return LGW_REG_SUCCESS;

}

/* ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ */

int esp_lgw_reg_wb(uint16_t register_id, uint8_t *data, uint16_t size) {
    const struct lgw_reg_s *r;

    /* check input parameters */
    if (size == 0) {

        return LGW_REG_ERROR;
    }
    if (register_id >= LGW_TOTALREGS) {

        return LGW_REG_ERROR;
    }

    /* get register struct from the struct array */
    r = &loregs[register_id];

    /* reject write to read-only registers */
    if (r->rdon == 1) {

        return LGW_REG_ERROR;
    }

    /* select proper register page if needed */
    if ((r->page != -1)) {
        page_switch(r->page);
    }

    /* do the burst write */
    sx1308_spiWriteBurst(r->addr, data, size);

    return LGW_REG_SUCCESS;

}

/* ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ */

int esp_lgw_reg_rb(uint16_t register_id, uint8_t *data, uint16_t size) {
    const struct lgw_reg_s *r;

    /* check input parameters */
    if (size == 0) {

        return LGW_REG_ERROR;
    }
    if (register_id >= LGW_TOTALREGS) {

        return LGW_REG_ERROR;
    }

    /* get register struct from the struct array */
    r = &loregs[register_id];

    /* select proper register page if needed */
    if ((r->page != -1)) {
        page_switch(r->page);
    }

    /* do the burst read */
    sx1308_spiReadBurst(r->addr, data, size);

    return LGW_REG_SUCCESS;
}
